Конфигурация/Documents/Переоценка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Переоценка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/Переоценка/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Автозаполнение типа цены из настроек для нового документа
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Не ЗначениеЗаполнено(Объект.ТипЦен) Тогда
		Объект.ТипЦен = НастройкиПоУмолчанию.ПолучитьОсновнойТипЦен();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// При выборе номенклатуры получаем текущую цену
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекущаяЦена = ПолучитьТекущуюЦенуНоменклатуры(ТекущиеДанные.Номенклатура, Объект.ТипЦен);
		ТекущиеДанные.СтараяЦена = ТекущаяЦена;
		
		// Если новая цена не заполнена, устанавливаем её равной старой
		Если ТекущиеДанные.Цена = 0 Тогда
			ТекущиеДанные.Цена = ТекущаяЦена;
		КонецЕсли;
		
		// Рассчитываем процент изменения
		РассчитатьПроцентИзменения(ТекущиеДанные);
	КонецЕсли;
	
	// Очищаем штрихкод при изменении номенклатуры
	ТекущиеДанные.Штрихкод = "";
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ТоварыШтрихкодПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка на пустой штрихкод
	Если ПустаяСтрока(ТекущиеДанные.Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск номенклатуры по штрихкоду
	НайденнаяНоменклатура = НайтиНоменклатуруПоШтрихкоду(ТекущиеДанные.Штрихкод);
	
	Если НайденнаяНоменклатура = Неопределено Тогда
		
		// Товар не найден - показываем предупреждение
		Ждать ПредупреждениеАсинх("Товар с штрихкодом """ + ТекущиеДанные.Штрихкод + """ не найден!");
		ТекущиеДанные.Штрихкод = "";
		Возврат;
		
	КонецЕсли;
	
	// Заполняем номенклатуру
	ТекущиеДанные.Номенклатура = НайденнаяНоменклатура;
	
	// Получаем текущую цену
	ТекущаяЦена = ПолучитьТекущуюЦенуНоменклатуры(НайденнаяНоменклатура, Объект.ТипЦен);
	ТекущиеДанные.СтараяЦена = ТекущаяЦена;
	
	// Если новая цена не заполнена, устанавливаем её равной старой
	Если ТекущиеДанные.Цена = 0 Тогда
		ТекущиеДанные.Цена = ТекущаяЦена;
	КонецЕсли;
	
	// Рассчитываем процент изменения
	РассчитатьПроцентИзменения(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Рассчитываем процент изменения
	РассчитатьПроцентИзменения(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НайтиНоменклатуруПоШтрихкоду(Штрихкод)
	
	// Поиск в регистре Штрихкоды
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Номенклатура;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущуюЦенуНоменклатуры(Номенклатура, ТипЦен)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Получаем текущую цену из регистра ЦеныНоменклатуры
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьПроцентИзменения(СтрокаТЧ)
	
	// Проверяем, что старая цена заполнена и больше нуля
	Если СтрокаТЧ.СтараяЦена = 0 Тогда
		СтрокаТЧ.ПроцентИзменения = 0;
		Возврат;
	КонецЕсли;
	
	// Формула: ((НоваяЦена - СтараяЦена) / СтараяЦена) * 100
	РазницаЦен = СтрокаТЧ.Цена - СтрокаТЧ.СтараяЦена;
	СтрокаТЧ.ПроцентИзменения = Окр((РазницаЦен / СтрокаТЧ.СтараяЦена) * 100, 2);
	
КонецПроцедуры

#КонецОбласти
